Completed Database diagram(ER Diagram) Modified class diagram and actor usecase diagram to fit
